Repository: phanphucloc/training-app-todo
Catalog: src/locale/messages.*.xlf
Languages: vi

# alert-delete-success
source: you have successfully deleted
vi: Bạn đã xoá thành công

# alert-send-successfully
source: Send successfully. Please check in your email to verify your email
vi: Gởi thành công! vui lòng kiểm tra email của bạn

# alert-send-failed
source: Send failed. Please try again
vi: Gởi thất lại! vui lòng thử lại

# alert-add-success
source: You have successfully added
vi: Bạn đã thêm công

# alert-update-success
source: You have successfully updated
vi: Bạn đã cập nhật thành công

source: Language
vi: Ngôn ngữ

# token-has-expired
source: Your token has expired, please login again to continue
vi: Token của bạn đã hết hạn, vui lòng đăng nhập lại để tiếp tục

source: English
vi: Tiếng Anh

source: Vienamese
vi: Tiếng Việt

# notification-title
source: Notification
vi: Thông báo

# notification-alertDelete
source: Are you sure you want to delete?
vi: Bạn thực sự muốn xoá?

# notification-disagree
source: Disagree
vi: Không

# notification-agree
source: Agree
vi: Đồng ý

# block-formTodo-labelTitle
source: Title
vi: Tiêu đề

# block-formTodo-messErrorRequiredTitle
source: Title is required
vi: Vui lòng nhập tiêu đề

# block-formTodo-messErrorExistTitle
source: The title already exists
vi: Tiêu đề đã tồn tại

# block-formTodo-messErrorMaxlength
source: Max length is:
vi: Số kí tự tối đa là:

# block-formTodo-labelCreator
source: Creator
vi: Người tạo

# block-formTodo-messErrorRequiredContent
source: Content is required
vi: Vui lòng nhập nội dung

# block-formTodo-labelContent
source: Content
vi: Nội dung

# block-formTodo-messErrorIncorrectTimeFormat
source: Incorrect time format
vi: Vui lòng nhập đúng định dạng thời gian

# block-formTodo-messErrorLimitTime
source: You are not allowed to choose a time before today
vi: Bạn không được thời gian trước ngày hôm nay

# block-formTodo-labelCompleted
source: Completed
vi: Hoàn thành

# block-formTodo-cancel
source: Cancel
vi: Huỷ

# block-formTodo-submit
source: Submit
vi: Gởi

source: Filter
vi: Lọc

# form-todo-labelTitle
source: Title
vi: Tiêu đề

# form-todo-label-creator
source: Creator
vi: Người tạo

# form-todo-label-content
source: Content
vi: Nội dung

# form-todo-label-completed
source: Completed
vi: Hoàn thành

# block-table-row-createdDate
source: Created date
vi: Ngày tạo

# block.table.title
source: List Todo
vi: Danh sách Todo

# button.add
source: Add
vi: Thêm

# block-table-row-title
source: Title
vi: Tiêu đề

# block-table-row-content
source: Content
vi: Nội dung

# block-table-row-creator
source: Creator
vi: Người tạo

# block-table-row-completed
source: Completed
vi: Hoàn thành

# description-title
source: Description
vi: Mô tả

# description-text
source: This is a small web signal page built by framework angular version 10.0.1
vi: Đây là một trang web signal page đơn giản được xây dựng bởi framework angular phiên bản 10.0.1

source: Features
vi: Tính năng

# internationalization
source: Application can change language (default language is English)
vi: Ứng dụng có thể thay đổi ngôn ngữ( ngôn ngữ mặc định là tiếng Anh)

# CRUD
source: Provide basic features add, delete, edit
vi: Cung cấp các tính năng cơ bản như: Thêm, Xoá, Sửa, Đọc

# filter
source: Features filtering data using Observables & Rxjs
vi: Có tính năng lọc dữ liệu sử dụng Observables & Rxjs

# stateManagement
source: Using akita to manage State management
vi: Sử dụng akita để quản lí State management

# reactiveForm
source: Implement reactive form, create abstract form for 2 both of cases (creation, edition)
vi: Sử dụng reactive form

source: version
vi: Phiên bản

source: Owner
vi: Người tạo

# lphan
source: Loc Phan Phuc
vi: Phan Phúc Lộc

# telephone
source: Phone
vi: Số điện thoại

# block-formLogin-text-register
source: Register
vi: Đăng kí

# block-formLogin-text-forgot-password
source: Forgot Password
vi: Quên mật khẩu

# block-formLogin-title-register
source: Register
vi: Đăng kí

# block-formLogin-text-go-to-login
source: Go back to Login
vi: Quay lại trang đăng nhập

# block-formLogin-button-register
source: Register
vi: Đăng kí

# block-formLogin-title
source: Login
vi: Đăng nhập

# block-formLogin-error-emailRequired
source: Email is required
vi: Vui lòng nhập email

# block-formLogin-error-emailMaxLength
source: Max length is:
vi: Độ dài tối đa là:

# block-formLogin-error-emailFormat
source: Email format is incorrect
vi: Email không đúng định dạng

# block-formLogin-error-passwordMaxlength
source: Max length is:
vi: Độ dài tối đa là:

# block-formLogin-error-emailPassword
source: Username or password is incorrect
vi: Email hoặc mật khẩu không đúng

# block-formLogin-title-verify-email
source: Thank You For Registering
vi: Cảm ơn bạn đã đăng kí

# block-formLogin-text-send-email
source: We have sent a confirmation email to
vi: Chúng tôi đã gởi một email xác nhận tới

# block-formLogin-text-send-please-check-email
source: Please check your email and click on the link to verify your email address.
vi: Vui lòng check trong hộp thư của bạn để xác thực.

# block-formLogin-button-Resend-email
source: Resend Verification Email
vi: Gởi lại

# block-formLogin-reset-password
source: Reset Password
vi: Thay Đổi Mật Khẩu

# block-formLogin-button-reset-password
source: Reset Password
vi: Thay đổi
